import unittest

def setUp(self):
    #self.
def tearDown(self):
    pass

def test_分類數字起頭:
	原來 = ["0501-230001-1107-04.trs",
  		'0501-230001-110704-0917-111229.trs',
		'0501-230001-110704-0917.trs',
		]

	結果 = [['name:0501-230001',
		 '0:20110704 0501-230001-1107-04.trs',
		 '1:20110917 0501-230001-110704-0917.trs',
		 '2:20111229 0501-230001-110704-0917-111229.trs']]
        #self.assertEqual(self.(原來), 結果)


def test_分類數字起頭_2:
	原來 = ["0501-230001-1107-04.trs",
  		'0501-230001-110704-0917-111229.trs',
		'0501-230001-110704-0917.trs',
		'0513-230001-110723-1113-111231.trs'
		]

	結果 = [['name:0501-230001',
		 '0:20110704 0501-230001-1107-04.trs',
		 '1:20110917 0501-230001-110704-0917.trs',
		 '2:20111229 0501-230001-110704-0917-111229.trs'],
		['name:0513-230001','0:20111231 0513-230001-110723-1113-111231.trs']]
        #self.assertEqual(self.(原來), 結果)


def test_分類英文小寫起頭_混不同日期格式:
	原來 = ['blktc01-zy-20130831-1005.trs',
  		'blktc01-zy-20130831.trs',
		'blktc03-1020831.trs',
		'blktc03-zy-1020831-20131005-20140220.trs',
		'blktc03-zy-20131005.trs'
		]

	結果 = [['name:blktc03-1020831',
		 '0:20130831 blktc03-1020831'],
		['name:blktc01-zy',
		 '0:20130831 blktc01-zy-20130831.trs',
		 '1:20131005 blktc01-zy-20130831-1005.trs'],
		['name:blktc03-zy',
		 '0:20131005 blktc03-zy-20131005.trs',
		 '1:20131005 blktc03-zy-1020831-20131005-20140220.trs']]
        #self.assertEqual(self.(原來), 結果)


def test_分類英文大寫起頭_混不同日期格式:
	原來 = ['PTSN_20130105-zy-130110-130217-130226.trs',
  		'PTSN_20130105-zy-130110-130217.trs',
		'PTSN_20130105-zy-130110.trs',
		'PTSN_20130120-zy-20130309-qdl.trs',
		'PTSN_20130120-zy.trs'
		]


	結果 = [['name:PTSN_20130105-zy',
		 '0:20130110 PTSN_20130105-zy-130110.trs',
		 '1:20130217 PTSN_20130105-zy-130110-130217.trs',
  		 '2:20130226 PTSN_20130105-zy-130110-130217-130226.trs',
		['name:PTSN_20130120-zy',
		 '0:unknown PTSN_20130120-zy.trs',
		 '1:20130309 PTSN_20130120-zy-20130309-qdl.trs'],
	#self.assertEqual(self.(原來), 結果)


def test_分類符號起頭:
	原來 = ['_Chen Tsau_30-1021103-1115-1216.trs',
  		'_Chen Tsau_30-1021103-1115.trs',
		'_Chen Tsau_30-1021103.trs',
		'_Chen Tsau_40-1021119-1208-1225.trs',
		'_Chen Tsau_40-1021119-1208.trs',
		'_Chen Tsau_40-1021119.trs']


	結果 = [['name:_Chen Tsau_30',
		 '0:20131103 _Chen Tsau_30-1021103.trs',
		 '1:20131115 _Chen Tsau_30-1021103-1115.trs',
  		 '2:20131216 _Chen Tsau_30-1021103-1115-1216.trs',
		['name:_Chen Tsau_40',
		 '0:20131119 _Chen Tsau_40-1021119.trs',
		 '1:20131208 _Chen Tsau_40-1021119-1208.trs'
		 '2:20131225 _Chen Tsau_40-1021119-1208-1225.trs']]
        #self.assertEqual(self.(原來), 結果)





