def 檔案分類(檔案成員):

	字典_暫存 = {}
	結果 = []
	x = 0
	異常陣列 = []
	
	檔案成員.sort()
	
	while x < len(檔案成員):
		try:
			要找的首個檔 = 檔案成員[x]
			要找的首個檔_去雜 = 要找的首個檔.strip()
			要找的首個檔去除副檔名 = 要找的首個檔_去雜.strip(".trs")
			首檔分割陣列 = 要找的首個檔去除副檔名.split('-')

			if(len(首檔分割陣列)>1):
					首檔的檔名 = 首檔分割陣列[0] + '-' + 首檔分割陣列[1]
			else:
					首檔的檔名 = 要找的首個檔去除副檔名

			首檔日期數 = len(首檔分割陣列) - 2
			
			排列後陣列 = ['','','']
			日期陣列 = ['','','']
			排列後陣列[首檔日期數-1] = 要找的首個檔
			日期陣列[首檔日期數-1] = "20" + 首檔分割陣列[-1]

			y = x + 1
		
			if(y>=len(檔案成員)):
				字典_暫存= {'name':首檔的檔名,'0':日期陣列[0]+' '+排列後陣列[0]}	 
				結果.append(字典_暫存)
				print("檔名:",字典_暫存['name'])
				print(" 0->",字典_暫存['0'])
				break
			
		
			while y<len(檔案成員):	
				要辨識的檔 = 檔案成員[y]
				要辨識的檔_去雜= 要辨識的檔.strip()
				要辨識的檔去除副檔名 = 要辨識的檔_去雜.strip('.trs')
				要辨識的分割陣列 = 要辨識的檔去除副檔名.split('-')	

				if(len(要辨識的分割陣列)>1):
					要被辨識的檔名 = 要辨識的分割陣列[0] + '-' + 要辨識的分割陣列[1]
				else:
					要被辨識的檔名 = 要辨識的檔去除副檔名

				if (要被辨識的檔名==首檔的檔名):
						y += 1
						辨識檔日期數 = len(要辨識的分割陣列) - 2
						排列後陣列[辨識檔日期數-1] = 要辨識的檔
						日期陣列[辨識檔日期數-1] = "20" + 要辨識的分割陣列[-1]
				else:
					字典_暫存= {'name':首檔的檔名,'0':日期陣列[0]+' '+排列後陣列[0],'1':日期陣列[1]+' '+排列後陣列[1],'2':日期陣列[2]+' '+排列後陣列[2]}
					if(字典_暫存['1']==' '):
						del 字典_暫存['1']
					if(字典_暫存['2']==' '):
						del 字典_暫存['2']
					結果.append(字典_暫存)
					print("檔名:",字典_暫存['name'])
					print(" 0->",字典_暫存['0'])
					
					if(字典_暫存['1']!=' '):
						print(" 1->",字典_暫存['1'])
					if(字典_暫存['2']!=' '):
						print(" 2->",字典_暫存['2'])
					
					break
				
			x = y
		
			if(x>=len(檔案成員)):
				字典_暫存= {'name':首檔的檔名,'0':日期陣列[0]+' '+排列後陣列[0],'1':日期陣列[1]+' '+排列後陣列[1],'2':日期陣列[2]+' '+排列後陣列[2]}
				if(字典_暫存['1']==' '):
							del 字典_暫存['1']
				if(字典_暫存['2']==' '):
							del 字典_暫存['2']
				結果.append(字典_暫存)
				print("檔名:",字典_暫存['name'])
				print(" 0->",字典_暫存['0'])
					
				if(字典_暫存['1']!=' '):
						print(" 1->",字典_暫存['1'])
				if(字典_暫存['2']!=' '):
						print(" 2->",字典_暫存['2'])
				break
			
		except:
				異常組合 = "要找的首檔:"+ 要找的首個檔 + "要辨識的檔:" + 要辨識的檔
				異常陣列.append(異常組合)
				
				
	if(len(異常陣列) != 0):
		print("在以下檔案時發生例外:")
		print(異常陣列)
		

	return 結果

if __name__ == '__main__':
	原來 = ["0501-230001-110704.trs",
				'0501-230001-110704-110917-111229.trs',
				'0501-230001-110704-110917.trs',
				'0513-230001-110723.trs']

	print(檔案分類(原來))
