def 檔案分類(檔案成員):

	字典_暫存 = {}
	結果 = []
	x = 0
	異常陣列 = []
	
	檔案成員.sort()
	輸出檔 = open("版本整理result.txt","w",encoding = 'UTF-8')
	
	'''run所有成員'''
	while x < len(檔案成員):
		#print(檔案成員[x])
		try:
			'''要當標的的檔先做些處理'''
			要找的首個檔 = 檔案成員[x]
			要找的首個檔_去雜 = 要找的首個檔.strip()
			要找的首個檔去除副檔名 = 要找的首個檔_去雜.strip(".trs")
			首檔分割陣列 = 要找的首個檔去除副檔名.split('-')
			
			'''按-做檔名切割 依不同情形來設定參數'''
			if(len(首檔分割陣列)>1):
				if(首檔分割陣列[0][0]=='_' or 首檔分割陣列[0][0]=='C' or 首檔分割陣列[0][0]== 'F' or 首檔分割陣列[0][0]== 'H' or 首檔分割陣列[0][0]== 'L'):
					首檔的檔名 = 首檔分割陣列[0]
					首檔日期數 = len(首檔分割陣列) - 1
				else:
					首檔的檔名 = 首檔分割陣列[0] + '-' + 首檔分割陣列[1]
					首檔日期數 = len(首檔分割陣列) - 2
			else:
				首檔的檔名 = 要找的首個檔去除副檔名
				首檔日期數 = len(首檔分割陣列) - 1

			排列後陣列 = ['','',''] 	#依校正日期版本
			日期陣列 = ['','','']		#放校正日期
			排列後陣列[首檔日期數-1] = 要找的首個檔   #根據抓到的校正日期版本來放在對應位置
			if (len(首檔分割陣列[-1])==8):
				日期陣列[首檔日期數-1] = 首檔分割陣列[-1]
			else:
				日期陣列[首檔日期數-1] = "Unknown"

			y = x + 1
		
			if(y>=len(檔案成員)):
				字典_暫存= {'name':首檔的檔名,'0':日期陣列[0]+' '+排列後陣列[0]}	 
				結果.append(字典_暫存)
				輸出檔.write("Name:" + 字典_暫存['name'] + "\n")
				輸出檔.write(" 0->" + 字典_暫存['0'] + "\n\n")
				break
			
		
			while y<len(檔案成員):	
				要辨識的檔 = 檔案成員[y]
				要辨識的檔_去雜= 要辨識的檔.strip()
				要辨識的檔去除副檔名 = 要辨識的檔_去雜.strip('.trs')
				要辨識的分割陣列 = 要辨識的檔去除副檔名.split('-')	

				if(len(要辨識的分割陣列)>1):
					if(要辨識的分割陣列[0][0]=='_' or 首檔分割陣列[0][0]=='C' or 首檔分割陣列[0][0]== 'F' or 首檔分割陣列[0][0]== 'H' or 首檔分割陣列[0][0]== 'L'):
						要被辨識的檔名  = 要辨識的分割陣列[0]
						辨識檔日期數 = len(要辨識的分割陣列) - 1
					else:
						要被辨識的檔名  = 要辨識的分割陣列[0] + '-' + 要辨識的分割陣列[1]
						辨識檔日期數 = len(要辨識的分割陣列) - 2
				else:
					要被辨識的檔名 = 要辨識的檔去除副檔名
					辨識檔日期數 = len(要辨識的分割陣列) - 1

				if (要被辨識的檔名==首檔的檔名):
						y += 1
						排列後陣列[辨識檔日期數-1] = 要辨識的檔
						if(len(要辨識的分割陣列[-1])==8):
							日期陣列[辨識檔日期數-1] = 要辨識的分割陣列[-1]
						else:
							日期陣列[辨識檔日期數-1] = "Unknown"
				else:
					字典_暫存= {'name':首檔的檔名,'0':日期陣列[0]+' '+排列後陣列[0],'1':日期陣列[1]+' '+排列後陣列[1],'2':日期陣列[2]+' '+排列後陣列[2]}
					if(字典_暫存['1']==' '):
						del 字典_暫存['1']
					if(字典_暫存['2']==' '):
						del 字典_暫存['2']
					結果.append(字典_暫存)
					輸出檔.write("Name:" + 字典_暫存['name'] + "\n")
					輸出檔.write(" 0->" + 字典_暫存['0'] + "\n")
					
					if('1' in 字典_暫存.keys()):
						輸出檔.write(" 1->" + 字典_暫存['1'] + "\n")
						
					if('2' in 字典_暫存.keys()):
						輸出檔.write(" 2->" + 字典_暫存['2'] + "\n")
						
					輸出檔.write("\n")
					
					break
				
			x = y
		
			if(x>=len(檔案成員)):
				字典_暫存= {'name':首檔的檔名,'0':日期陣列[0]+' '+排列後陣列[0],'1':日期陣列[1]+' '+排列後陣列[1],'2':日期陣列[2]+' '+排列後陣列[2]}
				if(字典_暫存['1']==' '):
							del 字典_暫存['1']
				if(字典_暫存['2']==' '):
							del 字典_暫存['2']
				結果.append(字典_暫存)
				
				輸出檔.write("Name:" + 字典_暫存['name'] + "\n")
				輸出檔.write(" 0->" + 字典_暫存['0'] + "\n")
				
				if('1' in 字典_暫存.keys()):
					輸出檔.write(" 1->" + 字典_暫存['1'] + "\n")
				if('2' in 字典_暫存.keys()):
					輸出檔.write(" 2->" + 字典_暫存['2'] + "\n")
						
				輸出檔.write("\n")
				break
			
		except:
				異常組合 = "要找的首檔:"+ 要找的首個檔 + "要辨識的檔:" + 要辨識的檔
				異常陣列.append(異常組合)
				
				
	if(len(異常陣列) != 0):
		輸出檔.write("在以下檔案時發生例外:\n")
		輸出檔.write(異常陣列)
		
	輸出檔.close()

	return 結果

if __name__ == '__main__':
	原來 = ["0501-230001-20110704.trs",
				'0501-230001-20110704-20110917-20111229.trs',
				'0501-230001-20110704-20110917.trs',
				'0513-230001-20110723.trs']
	
	檔案成員 = []
	
	with open("D:/test.txt") as 輸入檔:
		for 成員  in 輸入檔:
			檔案成員.append(成員.strip())
	
	print(檔案分類(檔案成員))
